RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/inc/ht32f1xxxx_usart.h
/* USART Synchronous Clock ---------------------------------------------------------------------------------*/
/** @defgroup USART_Synchronous_Clock Definitions of USART synchronous clock
  * @{
  */
#define USART_SYN_CLOCK_DISABLE                 ((u32)0x00000000)
#define USART_SYN_CLOCK_ENABLE                  ((u32)0x00000001)

#define IS_USART_SYNCHRONOUS_CLOCK(SYNCLOCK)    ((SYNCLOCK == USART_SYN_CLOCK_DISABLE) || \
                                                 (SYNCLOCK == USART_SYN_CLOCK_ENABLE))
/**
  * @}
  */

/* USART Synchronous Clock Phase ---------------------------------------------------------------------------*/
/** @defgroup USART_Synchronous_Clock_Phase Definitions of USART Synchronous clock phase
  * @{
  */
#define USART_SYN_CLOCK_PHASE_FIRST             ((u32)0x00000000)
#define USART_SYN_CLOCK_PHASE_SECOND            ((u32)0x00000004)

#define IS_USART_SYNCHRONOUS_PHASE(PHASE)       ((PHASE == USART_SYN_CLOCK_PHASE_FIRST) || \
                                                 (PHASE == USART_SYN_CLOCK_PHASE_SECOND))
/**
  * @}
  */

/* USART Clock Polarity ------------------------------------------------------------------------------------*/
/** @defgroup USART_Clock_Polarity Definitions of USART clock polarity
  * @{
  */
#define USART_SYN_CLOCK_POLARITY_LOW            ((u32)0x00000000)
#define USART_SYN_CLOCK_POLARITY_HIGH           ((u32)0x00000008)

#define IS_USART_SYNCHRONOUS_POLARITY(POLARITY) ((POLARITY == USART_SYN_CLOCK_POLARITY_LOW) || \
                                                 (POLARITY == USART_SYN_CLOCK_POLARITY_HIGH))
/**
  * @}
  */

/* USART IrDA  ---------------------------------------------------------------------------------------------*/
/** @defgroup USART_IrDA Definitions of USART IrDA
  * @{
  */
#define USART_IRDA_LOWPOWER                     ((u32)0x00000002)
#define USART_IRDA_NORMAL                       ((u32)0xFFFFFFFD)

#define IS_USART_IRDA_MODE(MODE)                ((MODE == USART_IRDA_LOWPOWER) || \
                                                 (MODE == USART_IRDA_NORMAL))

#define USART_IRDA_TX                           ((u32)0x00000004)
#define USART_IRDA_RX                           ((u32)0xFFFFFFFB)

#define IS_USART_IRDA_DIRECTION(DIRECTION)      ((DIRECTION == USART_IRDA_TX) || \
                                                 (DIRECTION == USART_IRDA_RX))
/**
  * @}
  */

#define IS_USART_TL(x)                (IS_USART_RXTL(x) || IS_USART_TXTL(x))

/* USART Rx FIFO Interrupt Trigger Level -------------------------------------------------------------------*/
/** @defgroup USART_RX_FIFO_Trigger_Level Definitions of USART Rx FIFO interrupts
  * @{
  */
#if (LIBCFG_USART_V01)
#define USART_RXTL_01                 ((u32)0x00000000)
#define USART_RXTL_04                 ((u32)0x00000010)
#define USART_RXTL_08                 ((u32)0x00000020)
#define USART_RXTL_14                 ((u32)0x00000030)

#define IS_USART_RXTL(RXTL)           ((RXTL == USART_RXTL_01) || \
                                       (RXTL == USART_RXTL_04) || \
                                       (RXTL == USART_RXTL_08) || \
                                       (RXTL == USART_RXTL_14))
#else
#define USART_RXTL_01                 ((u32)0x00000000)
#define USART_RXTL_02                 ((u32)0x00000010)
#define USART_RXTL_04                 ((u32)0x00000020)
#define USART_RXTL_06                 ((u32)0x00000030)

#define IS_USART_RXTL(RXTL)           ((RXTL == USART_RXTL_01) || \
                                       (RXTL == USART_RXTL_02) || \
                                       (RXTL == USART_RXTL_04) || \
                                       (RXTL == USART_RXTL_06))
#endif
/**
  * @}
  */

/* USART Tx FIFO Interrupt Trigger Level -------------------------------------------------------------------*/
/** @defgroup USART_TX_FIFO_Trigger_Level Definitions of USART Tx FIFO interrupts
  * @{
  */
#if (LIBCFG_USART_V01)
#define USART_TXTL_00                 ((u32)0x00000000)
#define USART_TXTL_02                 ((u32)0x00000010)
#define USART_TXTL_04                 ((u32)0x00000020)
#define USART_TXTL_08                 ((u32)0x00000030)

#define IS_USART_TXTL(TXTL)           ((TXTL == USART_TXTL_00) || \
                                       (TXTL == USART_TXTL_02) || \
                                       (TXTL == USART_TXTL_04) || \
                                       (TXTL == USART_TXTL_08))
#else
#define USART_TXTL_00                 ((u32)0x00000000)
#define USART_TXTL_02                 ((u32)0x00000010)
#define USART_TXTL_04                 ((u32)0x00000020)
#define USART_TXTL_06                 ((u32)0x00000030)

#define IS_USART_TXTL(TXTL)           ((TXTL == USART_TXTL_00) || \
                                       (TXTL == USART_TXTL_02) || \
                                       (TXTL == USART_TXTL_04) || \
                                       (TXTL == USART_TXTL_06))
#endif
/**
  * @}
  */

/* USART Interrupt definition ------------------------------------------------------------------------------*/
/** @defgroup USART_Interrupt_Enable Definitions of USART interrupt Enable bits
  * @{
  */
#if (LIBCFG_USART_V01)
#define USART_INT_RXDR                ((u32)0x00000001)
#define USART_INT_TXDE                ((u32)0x00000002)
#define USART_INT_RLSIE               ((u32)0x00000004)
#define USART_INT_MSIE                ((u32)0x00000008)
#define USART_INT_TOUT                ((u32)0x00000100)

#if (LIBCFG_USART_V01_LEGACY)
#define USART_IER_RDAIE               (USART_INT_RXDR)
#define USART_IER_THREIE              (USART_INT_TXDE)
#define USART_IER_RLSIE               (USART_INT_RLSIE)
#define USART_IER_MSIE                (USART_INT_MSIE)
#endif

#define IS_USART_INT(INT)             ((((INT) & 0xFFFFFFF0) == 0) && ((INT) != 0))

#define USART_IID_RLS                 ((u8)0x06)
#define USART_IID_RDA                 ((u8)0x04)
#define USART_IID_CTI                 ((u8)0x0C)
#define USART_IID_THRE                ((u8)0x02)
#define USART_IID_MS                  ((u8)0x00)
#define USART_IID_NON                 ((u8)0x01)

#define IS_USART_IID(IID)             ((IID == USART_IID_RLS)  || \
                                       (IID == USART_IID_RDA)  || \
                                       (IID == USART_IID_CTI)  || \
                                       (IID == USART_IID_THRE) || \
                                       (IID == USART_IID_MS)   || \
                                       (IID == USART_IID_NON))

#else
#define USART_INT_RXDR                ((u32)0x00000001)
#define USART_INT_TXDE                ((u32)0x00000002)
#define USART_INT_TXC                 ((u32)0x00000004)
#define USART_INT_OE                  ((u32)0x00000008)
#define USART_INT_PE                  ((u32)0x00000010)
#define USART_INT_FE                  ((u32)0x00000020)
#define USART_INT_BI                  ((u32)0x00000040)
#define USART_INT_RSADD               ((u32)0x00000080)
#define USART_INT_TOUT                ((u32)0x00000100)
#define USART_INT_CTS                 ((u32)0x00000200)

#define IS_USART_INT(INT)             ((((INT) & 0xFFFFFC00) == 0) && ((INT) != 0))
#endif
/**
  * @}
  */

/* USART Flags ---------------------------------------------------------------------------------------------*/
/** @defgroup USART_Flag Definitions of USART flags
  * @{
  */
#if (LIBCFG_USART_V01)
#define USART_FLAG_RXDNE              ((u32)0x00000001)
#define USART_FLAG_THRE               ((u32)0x00000020)
#define USART_FLAG_TXC                ((u32)0x00000040)
#define USART_FLAG_ERR                ((u32)0x00000080)

