RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_1xxxx_FWLib/library/HT32F1xxxx_Driver/inc/ht32f1xxxx_usart.h
#define USART_FLAG_FROM_IIR           ((u32)0x00000800)
#define USART_FLAG_MODIS              ((u32)0x00000800)
#define USART_FLAG_TXDE               ((u32)0x00000802)
#define USART_FLAG_RXDR               ((u32)0x00000804)
#define USART_FLAG_RLSI               ((u32)0x00000806)
#define USART_FLAG_TOUT               ((u32)0x0000080C)

#if (LIBCFG_USART_V01_LEGACY)
#define USART_LSR_RFDR                (USART_FLAG_RXDNE)
#define USART_LSR_THRE                (USART_FLAG_THRE)
#define USART_LSR_TE                  (USART_FLAG_TXC)
#define USART_LSR_ERR                 (USART_FLAG_ERR)
#endif

#define IS_USART_FLAG(FLAG)           ((FLAG == USART_FLAG_RXDNE) || \
                                       (FLAG == USART_FLAG_THRE)  || \
                                       (FLAG == USART_FLAG_TXC)   || \
                                       (FLAG == USART_FLAG_ERR)   || \
                                       (FLAG == USART_FLAG_TXDE)  || \
                                       (FLAG == USART_FLAG_RXDR)  || \
                                       (FLAG == USART_FLAG_TOUT))

#define USART_LSR_OE                   ((u32)0x00000002)
#define USART_LSR_PE                   ((u32)0x00000004)
#define USART_LSR_FE                   ((u32)0x00000008)
#define USART_LSR_BI                   ((u32)0x00000010)
#define USART_LSR_RSADD                ((u32)0x00000100)

#else
#define USART_FLAG_RXDNE              ((u32)0x00000001)
#define USART_FLAG_OE                 ((u32)0x00000002)
#define USART_FLAG_PE                 ((u32)0x00000004)
#define USART_FLAG_FE                 ((u32)0x00000008)
#define USART_FLAG_BI                 ((u32)0x00000010)
#define USART_FLAG_RXDR               ((u32)0x00000020)
#define USART_FLAG_TOUT               ((u32)0x00000040)
#define USART_FLAG_TXDE               ((u32)0x00000080)
#define USART_FLAG_TXC                ((u32)0x00000100)
#define USART_FLAG_RSADD              ((u32)0x00000200)
#define USART_FLAG_CTSC               ((u32)0x00000400)
#define USART_FLAG_CTSS               ((u32)0x00000800)

#define IS_USART_FLAG(FLAG)           ((FLAG == USART_FLAG_RXDNE) || (FLAG == USART_FLAG_OE)    || \
                                       (FLAG == USART_FLAG_PE)    || (FLAG == USART_FLAG_FE)    || \
                                       (FLAG == USART_FLAG_BI)    || (FLAG == USART_FLAG_RXDR)  || \
                                       (FLAG == USART_FLAG_TOUT)  || (FLAG == USART_FLAG_TXDE)  || \
                                       (FLAG == USART_FLAG_TXC)   || (FLAG == USART_FLAG_RSADD) || \
                                       (FLAG == USART_FLAG_CTSC)  || (FLAG == USART_FLAG_CTSS))

#define IS_USART_CLEAR_FLAG(FLAG)     ((FLAG == USART_FLAG_OE)    || (FLAG == USART_FLAG_PE)    || \
                                       (FLAG == USART_FLAG_FE)    || (FLAG == USART_FLAG_BI)    || \
                                       (FLAG == USART_FLAG_TOUT)  || (FLAG == USART_FLAG_RSADD) || \
                                       (FLAG == USART_FLAG_CTSC))
#endif
/**
  * @}
  */

/* USART RS485 definition ----------------------------------------------------------------------------------*/
/** @defgroup USART_RS485 Definitions of USART RS485
  * @{
  */
#define USART_RS485POLARITY_LOW                 ((u32)0x00000001)
#define USART_RS485POLARITY_HIGH                ((u32)0xFFFFFFFE)

#define IS_USART_RS485_POLARITY(POLARITY)       ((POLARITY == USART_RS485POLARITY_LOW) || \
                                                 (POLARITY == USART_RS485POLARITY_HIGH))
/**
  * @}
  */
#if (LIBCFG_USART_V01)
#define USART_FIFO_TX                           ((u32)0x00000004)
#define USART_FIFO_RX                           ((u32)0x00000002)
#else
#define USART_FIFO_TX                           ((u32)0x00000001)
#define USART_FIFO_RX                           ((u32)0x00000002)
#endif

#define IS_USART_FIFO_DIRECTION(DIRECTION)      ((DIRECTION == USART_FIFO_TX) || \
                                                 (DIRECTION == USART_FIFO_RX))

#if (LIBCFG_USART_V01)
#define USART_STICK_LOW                         ((u32)0x00000010)
#define USART_STICK_HIGH                        ((u32)0xFFFFFFEF)
#else
#define USART_STICK_LOW                         ((u32)0x00001000)
#define USART_STICK_HIGH                        ((u32)0xFFFFEFFF)
#endif

#define IS_USART_STICK_PARITY(PARITY)           ((PARITY == USART_STICK_LOW) || (PARITY == USART_STICK_HIGH))

#if (LIBCFG_USART_V01)
#define USART_PDMAREQ_TX                        ((u32)0x00000010)
#define USART_PDMAREQ_RX                        ((u32)0x00000020)
#else
#define USART_PDMAREQ_TX                        ((u32)0x00000040)
#define USART_PDMAREQ_RX                        ((u32)0x00000080)
#endif

#define IS_USART_PDMA_REQ(REQ)                  ((REQ == USART_PDMAREQ_TX) || (REQ == USART_PDMAREQ_RX))

#define IS_USART(USART)                         ((USART == HT_USART0) || \
                                                 (IS_USART1(USART))   || \
                                                 (USART == HT_UART0)  || \
                                                 (USART == HT_UART1))

#if (LIBCFG_NO_USART1)
#define IS_USART1(x)                            (0)
#else
#define IS_USART1(x)                            (x == HT_USART1)
#endif

#define IS_USART_BAUDRATE(BAUDRATE)             ((BAUDRATE > 0) && (BAUDRATE < 0x0044AA21))
#define IS_USART_DATA(DATA)                     (DATA <= 0x1FF)
#define IS_USART_GUARD_TIME(TIME)               (TIME <= 0xFF)
#define IS_USART_IRDA_PRESCALER(PRESCALER)      (PRESCALER <= 0xFF)
#define IS_USART_TIMEOUT(TIMEOUT)               (TIMEOUT <= 0x7F)
#define IS_USART_ADDRESS_MATCH_VALUE(VALUE)     (VALUE <= 0xFF)
/**
  * @}
  */

#if (LIBCFG_USART_V01)
/* USART Modem definition ----------------------------------------------------------------------------------*/
/** @defgroup USART_MODEM Definitions of USART Modem
  * @{
  */
#define USART_MODEM_DTR                        ((u32)0x00000000)
#define USART_MODEM_RTS                        ((u32)0x00000001)

#define IS_USART_MODEM_PIN(PIN) ((PIN == USART_MODEM_DTR) || (PIN == USART_MODEM_RTS))

#define USART_MODEMSTATE_HIGH                  ((u32)0x00000000)
#define USART_MODEMSTATE_LOW                   ((u32)0x00000001)

#define IS_USART_MODEM_STATE(STATE) ((STATE == USART_MODEMSTATE_HIGH) || (STATE == USART_MODEMSTATE_LOW))
/**
  * @}
  */
#endif

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup USART_Exported_Functions USART exported functions
  * @{
  */
#define USART_TxCmd(USARTx, NewState)              USART_TxRxCmd(USARTx, USART_CMD_TX, NewState)
#define USART_RxCmd(USARTx, NewState)              USART_TxRxCmd(USARTx, USART_CMD_RX, NewState)

